Repository: midnitehighways/lang-memorize
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: Be a
fi: Ole

source: Polyglot
fi: Polyglotti

source: Hello
fi: Moi

source: Log out
fi: Kirjaudu ulos

source: Log in using
fi: Kirjaudu sisään

source: Show words
fi: Näytä sanoja

source: Add new
fi: Lisää sana

source: Take a test
fi: Tarkista tietosi

source: Log in
fi: Kirjaudu sisään

source: About
fi: Yhteystiedot

source: Add an example
fi: Lisää esimerkki

source: Edit word
fi: Muokkaa sana

source: Delete word
fi: Poista sana

source: Add example
fi: Lisää

source: Currently there are no words in your own vocabulary.
fi: Sun sanastossa ei oo sanoja vielä.

source: Please, don't hesitate to add them :)
fi: Kuitenkin voit lisätä niitä nyt :)

source: Original
fi: Alkuperäinen

source: Enter original word
fi: Lisää alkuperäinen sana

source: Translation
fi: Käännös

source: Enter translation
fi: Lisää käännös

source: Type
fi: Tyyppi

source: Verb
fi: Verbi

source: Noun
fi: Substantiivi

source: Adjective
fi: Adjektiivi

source: Adverb
fi: Adverbi

source: Other
fi: Jotain muuta

source: Nothing
fi: Ei ollut mainittu

source: Choose suitable word type
fi: Valitse sopivan sanan tyypin

source: Add to common anonymous
fi: Lisää anonyymisti

source: Add to own vocabulary
fi: Lisää omaan sanastoon
